bin/tax-1.xml

<?xml version="1.0" ?>
  <S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
      <service xmlns="http://www.chinatax.gov.cn/spec/">
        &lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;service xmlns=&quot;http://www.chinatax.gov.cn/spec/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt; &lt;head&gt; &lt;tran_id&gt;SWZJ.HXZG.DJ.CXNSRYXSWDJZXX&lt;/tran_id&gt; &lt;channel_id&gt;SCGS.ZJNB.SSLZJDZDA&lt;/channel_id&gt; &lt;tran_seq&gt;4861e0d6b65e4d8aad0caa191fb63f70&lt;/tran_seq&gt; &lt;tran_date&gt;20141030&lt;/tran_date&gt; &lt;tran_time&gt;041348296&lt;/tran_time&gt; &lt;expand&gt; &lt;name&gt;identityType&lt;/name&gt; &lt;value&gt;3327006290056&lt;/value&gt; &lt;/expand&gt; &lt;expand&gt; &lt;name&gt;sjry&lt;/name&gt; &lt;value&gt;15100sslzj0&lt;/value&gt; &lt;/expand&gt; &lt;expand&gt; &lt;name&gt;sjjg&lt;/name&gt; &lt;value&gt;15100000000&lt;/value&gt; &lt;/expand&gt; &lt;/head&gt; &lt;body&gt;&lt;![CDATA[&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;!--Sample XML file generated by XMLSpy v2011 (http://www.altova.com)--&gt;&lt;taxML xsi:type=&quot;HXZGDJ00001Request&quot; xmlbh=&quot;String&quot; bbh=&quot;String&quot; xmlmc=&quot;String&quot; xsi:schemaLocation=&quot;http://www.chinatax.gov.cn/dataspec/ TaxMLBw_HXZG_DJ_00001_Request_V1.0.xsd&quot; xmlns=&quot;http://www.chinatax.gov.cn/dataspec/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt; &lt;djxh&gt;10115108000050656435&lt;/djxh&gt;&lt;/taxML&gt;]]&gt;&lt;/body&gt;&lt;/service&gt;
      </service>
    </S:Body>
  </S:Envelope>
